In [2]:
import pandas as pd

In [5]:
series = pd.Series(list(range(1, 20)))

In [6]:
'''
Create a sample pandas series with x integer elements. Perform the following operations on the same:
a. Print the first 5 elements of the series
b. Print the last 5 elements of the series
c. Insert an integer value ‘50’ at the index 5.
d. Update the last element in the series with the value 100.
e. Delete the first element from the series.
Note: The index values must not be affected by the operations and should be uniform for the series after the last operation.
'''

'\nCreate a sample pandas series with x integer elements. Perform the following operations on the same:\na. Print the first 5 elements of the series\nb. Print the last 5 elements of the series\nc. Insert an integer value ‘50’ at the index 5.\nd. Update the last element in the series with the value 100.\ne. Delete the first element from the series.\nNote: The index values must not be affected by the operations and should be uniform for the series after the last operation.\n'

In [15]:
series.head(6)

0     1
1     2
2     3
3     4
4     5
5    50
dtype: int64

In [19]:
series.tail(5)

14     15
15     16
16     17
17     18
18    100
dtype: int64

In [13]:
series.iloc[5] = 50

In [16]:
series.iloc[-1] = 100

In [21]:
series.drop(0, inplace=True)

In [28]:
series

0       2
1       3
2       4
3       5
4      50
5       7
6       8
7       9
8      10
9      11
10     12
11     13
12     14
13     15
14     16
15     17
16     18
17    100
dtype: int64

In [27]:
series.reset_index(drop=True, inplace=True)

In [ ]:
'''
For a given pandas series obtained in the 4th step. Write a sample code to find the element 100 in the series.
'''

In [49]:
def search(series, num) :   # have to work on this
    for i in len(series):
        if (series[i] == num) :
            return i

search(series, 100)

TypeError: 'int' object is not iterable

In [34]:
'''
For the given series A and B, perform concatenation on the same.
series_A = pd.Series([1,2,3,4,5]) 
series_B = pd.Series([6,7,8,9,10])
'''

'\nFor the given series A and B, perform concatenation on the same.\nseries_A = pd.Series([1,2,3,4,5]) \nseries_B = pd.Series([6,7,8,9,10])\n'

In [39]:
series_A = pd.Series([1,2,3,4,5]) 
series_B = pd.Series([6,7,8,9,10])

series_C = pd.concat([series_A, series_B])

In [40]:
series_C

0     1
1     2
2     3
3     4
4     5
0     6
1     7
2     8
3     9
4    10
dtype: int64

In [41]:
series_C.reset_index(drop=True)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [42]:
'''
Using loops in python, print all the elements within a pandas series.
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])
'''

'\nUsing loops in python, print all the elements within a pandas series.\nSample = pd.Series([1,2,3,4,5,6,7,8,9,10])\n'

In [48]:
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

for value in Sample:
    print(value)

1
2
3
4
5
6
7
8
9
10

1
2
3
4
5
6
7
8
9
10

In [50]:
'''
For a given nested list and a sample dictionary, create two data frames using pandas.
List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]
Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}
'''

"\nFor a given nested list and a sample dictionary, create two data frames using pandas.\nList = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]\nDictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}\n"

In [51]:
List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]
Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [52]:
pd.DataFrame(List)

    0   1   2
0  AA  BB  CC
1  DD  EE  FF
2  GG  HH  II

In [53]:
pd.DataFrame(Dictionary)

     Kris Memphis
0  Jordan   Depay
1      12      23
2      22      24

In [54]:
'''
Create a pandas Dataframe with two columns = [‘Name’, ‘Age’]. Perform the following operations on the same.
a. Print the first 3 rows of the Data Frame .
b. Print the rows that have the age greater than 35.
c. Insert 5 imaginary names and ages as values to the pandas Data Frame .
d. Update the 5th row so that the name = john and age=56.
e. Delete the first row from the Data Frame .
'''

'\nCreate a pandas Dataframe with two columns = [‘Name’, ‘Age’]. Perform the following operations on the same.\na. Print the first 3 rows of the Data Frame .\nb. Print the rows that have the age greater than 15.\nc. Insert 5 imaginary names and ages as values to the pandas Data Frame .\nd. Update the 5th row so that the name = john and age=56.\ne. Delete the first row from the Data Frame .\n'

In [57]:
my_dict = {"name" : ["rohit", "virat", "sachin", "ganguly", "abhishek"], "age" : [36, 35, 45, 46, 24]}

In [58]:
my_df = pd.DataFrame(my_dict)

In [59]:
my_df

       name  age
0     rohit   36
1     virat   35
2    sachin   45
3   ganguly   46
4  abhishek   24

In [60]:
my_df.head(3)

     name  age
0   rohit   36
1   virat   35
2  sachin   45

In [68]:
my_df[my_df.age > 35]
#my_df[my_df[age] > 35]

      name  age
0    rohit   36
2   sachin   45
3  ganguly   46

In [64]:
my_df.loc(5, 'name'] = "gambhir"
my_df.loc[5, 'age'] = 42

SyntaxError: closing parenthesis ']' does not match opening parenthesis '(' (530962101.py, line 1)

In [69]:
df2 = {'name': ['a', 'b', 'c', 'd', 'e'], 'age' : [14, 20, 35, 22, 45]}

In [71]:
my_df = pd.concat([my_df, df2])#have to work

TypeError: cannot concatenate object of type '<class 'dict'>'; only Series and DataFrame objs are valid

In [74]:
my_df

       name  age
0     rohit   36
1     virat   35
2    sachin   45
3   ganguly   46
4  abhishek   24

In [75]:
# my_df[5]

In [81]:
my_df.drop(0, inplace=True)

In [82]:
my_df.reset_index(drop=True, inplace=True)

In [83]:
my_df

       name  age
0     virat   35
1    sachin   45
2   ganguly   46
3  abhishek   24

In [84]:
'''
10. For the Data Frame obtained from step 9, convert the same to a list and a dictionary respectively.
'''

'\n10. For the Data Frame obtained from step 9, convert the same to a list and a dictionary respectively.\n'

In [86]:
list(my_df)

['name', 'age']

In [87]:
list(my_df.values)

[array(['virat', 35], dtype=object),
 array(['sachin', 45], dtype=object),
 array(['ganguly', 46], dtype=object),
 array(['abhishek', 24], dtype=object)]

In [89]:
my_df.keys

<bound method NDFrame.keys of        name  age
0     virat   35
1    sachin   45
2   ganguly   46
3  abhishek   24>

In [90]:
dict(my_df)

{'name': 0       virat
 1      sachin
 2     ganguly
 3    abhishek
 Name: name, dtype: object,
 'age': 0    35
 1    45
 2    46
 3    24
 Name: age, dtype: int64}

In [91]:
dict(my_df.values)

{'virat': 35, 'sachin': 45, 'ganguly': 46, 'abhishek': 24}

In [92]:
'''
11. Create two separate Data Frame s A and B, and perform the following operations on them.
a. Concatenate the two Data Frame s to a new Data Frame C.
b. Split the Data Frame C row wise.
c. Split the Data Frame column wise based on a condition. For example - columns
values greater than 10, column values less than 10, etc
'''

'\n11. Create two separate Data Frame s A and B, and perform the following operations on them.\na. Concatenate the two Data Frame s to a new Data Frame C.\nb. Split the Data Frame C row wise.\nc. Split the Data Frame column wise based on a condition. For example - columns\nvalues greater than 10, column values less than 10, etc\n'

In [94]:
df_A = pd.DataFrame({"name" : ["rohit", "virat", "sachin", "ganguly", "abhishek"], "age" : [36, 35, 45, 46, 24]})

In [95]:
df_B = pd.DataFrame({'name': ['a', 'b', 'c', 'd', 'e'], 'age' : [14, 20, 35, 22, 45]})

In [114]:
df_C = pd.concat([df_A, df_B])

In [118]:
df_C.reset_index(drop=True, inplace=True)
df_C

       name  age
0     rohit   36
1     virat   35
2    sachin   45
3   ganguly   46
4  abhishek   24
5         a   14
6         b   20
7         c   35
8         d   22
9         e   45

In [101]:
df_D = df_C.head()

In [102]:
df_D

       name  age
0     rohit   36
1     virat   35
2    sachin   45
3   ganguly   46
4  abhishek   24

In [110]:
df_E = df_C['age'][df_C['age'] > 30]

In [111]:
df_E

0    36
1    35
2    45
3    46
2    35
4    45
Name: age, dtype: int64

In [120]:
df_F = df_C['age' > 30]

TypeError: '>' not supported between instances of 'str' and 'int'

In [121]:
'''
12. Create a Data Frame with columns Name and Age. Perform the following operations.
a. Write a sample code to search for the Name/Names where Age is 20.
b. Sort the Data Frame in ascending order of ages.
c. Using Python loops, print the ages from the data frame and store it in a set
'''

'\n12. Create a Data Frame with columns Name and Age. Perform the following operations.\na. Write a sample code to search for the Name/Names where Age is 20.\nb. Sort the Data Frame in ascending order of ages.\nc. Using Python loops, print the ages from the data frame and store it in a set\n'

In [122]:
df_A = pd.DataFrame({"name" : ["rohit", "virat", "sachin", "ganguly", "abhishek"], "age" : [36, 35, 45, 46, 24]})

In [123]:
df_G = df_A['age' > 40]

df_G

TypeError: '>' not supported between instances of 'str' and 'int'

In [124]:
df_A.sort_values(by='age')

       name  age
4  abhishek   24
1     virat   35
0     rohit   36
2    sachin   45
3   ganguly   46

In [127]:
myset = set()

for i in df_A['age']:
    myset.add(i)

myset

{24, 35, 36, 45, 46}